app/views/admin/create_home_banner.html.erb

					<% if !@home_banner.blank?%>
						<% cont_selected = @home_banner.order_banner %>
---
SELECT `home_banners`.* FROM `home_banners`