app/controllers/admin_controller.rb

  def insert_module

  	  imagen_min = nil
  	  img_banner = nil
  	  imagen_min = save_file(params[:imagen_min],'img_modules') if !params[:imagen_min].blank?
  	  img_banner = save_file(params[:img_banner],'img_modules') if !params[:img_banner].blank?


  	  module_page = ModulePage.where('id=?',params['id']).take
  	  module_page = ModulePage.new if module_page.blank?
  	  module_page.name_module = params[:name_module]
  	  module_page.imagen_min = imagen_min if !imagen_min.nil?
  	  module_page.description = params[:description]
  	  module_page.img_banner = img_banner if !img_banner.nil?
  	  module_page.save
---
INSERT INTO `home_banners` (`image`, `order`, `created_at`, `updated_at`) VALUES ('dsfsd', 4, '2021-07-13 22:52:49.032650', '2021-07-13 22:52:49.032650')

  def insert_sub_module

      sub_module = SubModulePage.where('id=?',params['id']).take
      sub_module = SubModulePage.new if sub_module.blank?
      sub_module.module_page_id = params[:module_page_id]
      sub_module.sub_module_name = params[:sub_module_name]
      sub_module.description = params[:description]
      sub_module.link = params[:link]
      sub_module.content = params[:content]
      sub_module.save

      dependences = params[:dependences]
      SubModulePageDependence.where('sub_module_page_id=?',sub_module.id).destroy_all
      if !dependences.blank?
        dependences.each do |id|
          dependence = SubModulePageDependence.new
          dependence.sub_module_page_id = sub_module.id
          dependence.dependence_id = id
          dependence.save
---
UPDATE `sub_module_pages` SET `sub_module_pages`.`sub_module_name` = 'nombre contenido', `sub_module_pages`.`description` = '		asddas dasd sa		\r\n	\r\n	', `sub_module_pages`.`link` = 'dasdsa', `sub_module_pages`.`content` = '		das dsad sad sada sdsadsa\r\n	', `sub_module_pages`.`updated_at` = '2021-07-14 17:35:16.913953' WHERE `sub_module_pages`.`id` = 1
INSERT INTO `sub_module_pages` (`module_page_id`, `sub_module_name`, `description`, `link`, `content`, `created_at`, `updated_at`) VALUES (5, 'nombre contenido 1', '	dasd sa	\r\n	', 'dsadsa', '		\r\n	dsadsadsadasdsa', '2021-07-14 17:44:06.157789', '2021-07-14 17:44:06.157789')
INSERT INTO `sub_module_page_dependences` (`sub_module_page_id`, `dependence_id`, `created_at`, `updated_at`) VALUES (5, 4, '2021-07-14 17:48:02.920664', '2021-07-14 17:48:02.920664')

  def create_home_banner

    home_banner = HomeBanner.where('id = ?', params[:id]).take
    home_banner = HomeBanner.new if home_banner.blank?
---
SELECT `home_banners`.* FROM `home_banners` LIMIT 11


    home_banner.image =namefile
    home_banner.order = params[:order]
    home_banner.save
---
INSERT INTO `home_banners` (`image`, `order`, `created_at`, `updated_at`) VALUES ('prueba', 1, '2021-07-13 20:13:47.471950', '2021-07-13 20:13:47.471950')
UPDATE `home_banners` SET `home_banners`.`image` = 'prueba2', `home_banners`.`updated_at` = '2021-07-13 20:16:40.669692' WHERE `home_banners`.`id` = 2

  def delete_home_banner
    HomeBanner.where('id = ?', params[:id]).destroy_all
---
DELETE FROM `home_banners` WHERE `home_banners`.`id` = 54

  def list_home_banner
      @home_banner = HomeBanner.select('image','order').where('id = ?', params[:id])
---
SELECT `home_banners`.`image`, `home_banners`.`order` FROM `home_banners` WHERE (id = NULL)

  def create_contacts

    contacts = Contact.where('id = ?', params[:id]).take
    contacts = Contact.new if contacts.blank?
    contacts.name = params[:name]
    contacts.direccion = params[:direccion]
    contacts.edificio = params[:edificio]
    contacts.ciudad = params[:ciudad]
    contacts.telefono = params[:telefono]
    contacts.email = params[:email]

    contacts.save
---
SELECT `contacts`.* FROM `contacts` WHERE (id = NULL) LIMIT 1
UPDATE `contacts` SET `contacts`.`name` = 'John', `contacts`.`direccion` = 'Bogota', `contacts`.`edificio` = '1', `contacts`.`ciudad` = 'Bogota', `contacts`.`telefono` = '3124567891', `contacts`.`updated_at` = '2021-07-13 21:33:19.157262' WHERE `contacts`.`id` = 1
INSERT INTO `contacts` (`name`, `direccion`, `edificio`, `ciudad`, `telefono`, `email`, `created_at`, `updated_at`) VALUES ('dasda', 'dasda', 'dasdsa', 'dsadsa', 'dasdsa', 'dasd@adssda.com', '2021-07-14 20:05:32.358159', '2021-07-14 20:05:32.358159')

  def delete_contacts
    Contact.where('id = ?', params[:id]).destroy_all
---
DELETE FROM `contacts` WHERE `contacts`.`id` = 2
SELECT `contacts`.* FROM `contacts` WHERE (id = '2')

  def list_contacts
      contacts = Contact.select('name','direccion','edificio','ciudad','telefono','email')
---
SELECT `contacts`.`name`, `contacts`.`direccion`, `contacts`.`edificio`, `contacts`.`ciudad`, `contacts`.`telefono`, `contacts`.`email` FROM `contacts`