app/controllers/admin_controller.rb

INSERT INTO `home_banners` (`image`, `order`, `created_at`, `updated_at`) VALUES ('Captura de pantalla de 2021-07-06 17-05-03', 2, '2021-07-14 15:49:40.463944', '2021-07-14 15:49:40.463944')
---
  def insert_module

  	  imagen_min = nil
  	  img_banner = nil
  	  imagen_min = save_file(params[:imagen_min],'img_modules') if !params[:imagen_min].blank?
  	  img_banner = save_file(params[:img_banner],'img_modules') if !params[:img_banner].blank?


  	  module_page = ModulePage.where('id=?',params['id']).take
  	  module_page = ModulePage.new if module_page.blank?
  	  module_page.name_module = params[:name_module]
      module_page.show_name = params[:show_name]
  	  module_page.imagen_min = imagen_min if !imagen_min.nil?
      module_page.color_module = params[:color_module]
  	  module_page.description = params[:description]
      module_page.msg_felicitacion = params[:msg_felicitacion]
  	  module_page.img_banner = img_banner if !img_banner.nil?
  	  module_page.save