app/controllers/admin_controller.rb

  def index
  	@module_pages = ModulePage.all
    @home_banners = HomeBanner.all.order(order_banner: :asc)
    @contacts = Contact.all
    @user_admin = UserAdmin.all
    @menu_contents=MenuContent.where('id not in (3)')
---
SELECT `module_pages`.* FROM `module_pages` WHERE (id='1') LIMIT 1
SELECT `home_banners`.* FROM `home_banners` ORDER BY `home_banners`.`order_banner` ASC
SELECT `contacts`.* FROM `contacts`
SELECT `user_admins`.* FROM `user_admins`
SELECT `menu_contents`.* FROM `menu_contents` WHERE (id not in (3))

  def create_module
  	@module_page  = ModulePage.where('id=?',params['id']).take if !params['id'].blank?
---
SELECT `module_pages`.* FROM `module_pages` WHERE (id=NULL) LIMIT 1

  def insert_module

  	  imagen_min = nil
  	  img_banner = nil
  	  imagen_min = save_file(params[:imagen_min],'img_modules') if !params[:imagen_min].blank?
  	  img_banner = save_file(params[:img_banner],'img_modules') if !params[:img_banner].blank?


  	  module_page = ModulePage.where('id=?',params['id']).take
  	  module_page = ModulePage.new if module_page.blank?
  	  module_page.name_module = params[:name_module]
  	  module_page.imagen_min = imagen_min if !imagen_min.nil?
  	  module_page.description = params[:description]
  	  module_page.img_banner = img_banner if !img_banner.nil?
  	  module_page.save
---
SELECT `home_banners`.* FROM `home_banners` WHERE (id = NULL)
SELECT `module_pages`.* FROM `module_pages` WHERE (id=NULL) LIMIT 1
SELECT `module_pages`.* FROM `module_pages` WHERE (id='1')
UPDATE `module_pages` SET `module_pages`.`name_module` = 'Emociones', `module_pages`.`description` = '		dsadsadas\r\n	', `module_pages`.`updated_at` = '2021-07-14 16:36:13.064204' WHERE `module_pages`.`id` = 5
UPDATE `home_banners` SET `home_banners`.`image` = 'prueba2', `home_banners`.`updated_at` = '2021-07-13 20:16:40.669692' WHERE `home_banners`.`id` = 2
INSERT INTO `home_banners` (`image`, `order`, `created_at`, `updated_at`) VALUES ('#<ActionDispatch::Http::UploadedFile:0x00007f19508926a8>', 65, '2021-07-14 15:00:23.852368', '2021-07-14 15:00:23.852368')
INSERT INTO `module_pages` (`name_module`, `imagen_min`, `description`, `img_banner`, `created_at`, `updated_at`) VALUES ('Emociones', '/img_modules/2021-07-1517:04:36-0500_Selección_999(304).png', 'sadaddsadasdasdadasdsadsadas', '/img_modules/2021-07-1517:04:36-0500_Selección_999(303).png', '2021-07-15 22:04:36.833444', '2021-07-15 22:04:36.833444')

  def delete_module

  	module_page = ModulePage.where('id=?',params[:id])
  	delete_file(module_page[0]['imagen_min'])
  	delete_file(module_page[0]['img_banner'])

  	module_page.destroy_all
---
SELECT `module_pages`.* FROM `module_pages` WHERE (id='2')
DELETE FROM `module_pages` WHERE `module_pages`.`id` = 2

  def sub_module
    @sub_modules = SubModulePage.getSubmoduleModuleId(params[:id])
    @module_page = ModulePage.where('id=?',params[:id]).take
---
SELECT `module_pages`.* FROM `module_pages` WHERE (id='1') LIMIT 1

  def create_sub_module
    @module_page_id = params[:module_page_id]
    @sub_module  = SubModulePage.where('id=?',params['id']).take if !params['id'].blank?
    @dependences_id = []
    if !params['id'].blank?
      @dependences_id = SubModulePageDependence.where('sub_module_page_id=?',params['id']).collect(&:dependence_id)
    end
    @dependences = SubModulePage.where('module_page_id=?',@module_page_id)
    @dependences = @dependences.where('id not in (?)',params['id']) if !params['id'].blank?
---
SELECT `sub_module_pages`.* FROM `sub_module_pages` WHERE (id='1') LIMIT 1
SELECT `sub_module_page_dependences`.* FROM `sub_module_page_dependences` WHERE (sub_module_page_id='1')
SELECT `sub_module_pages`.* FROM `sub_module_pages` WHERE (id='5') LIMIT 1
SELECT `module_pages`.* FROM `module_pages` WHERE `module_pages`.`id` = 5 LIMIT 1

  def insert_sub_module

      file_pdf = nil
      file_pdf = save_file(params[:file_pdf],'file_pdfs') if !params[:file_pdf].blank?
      image_min = nil
  	  image_min = save_file(params[:image_min],'img_modules') if !params[:image_min].blank?

      sub_module = SubModulePage.where('id=?',params['id']).take
      sub_module = SubModulePage.new if sub_module.blank?
      sub_module.module_page_id = params[:module_page_id]
      sub_module.sub_module_name = params[:sub_module_name]
      sub_module.description = params[:description]
      sub_module.file_pdf = file_pdf if !file_pdf.nil?
      sub_module.link = params[:link]
      sub_module.content = params[:content]
      sub_module.image_min = image_min if !image_min.nil?
      sub_module.save

      dependences = params[:dependences]
      SubModulePageDependence.where('sub_module_page_id=?',sub_module.id).destroy_all
      if !dependences.blank?
        dependences.each do |id|
          dependence = SubModulePageDependence.new
          dependence.sub_module_page_id = sub_module.id
          dependence.dependence_id = id
          dependence.save
---
SELECT `sub_module_pages`.* FROM `sub_module_pages` WHERE `sub_module_pages`.`id` = 5 LIMIT 1
SELECT `module_pages`.* FROM `module_pages` WHERE `module_pages`.`id` = 1 LIMIT 1
UPDATE `sub_module_pages` SET `sub_module_pages`.`description` = '		nombre contenido 2	\r\n	', `sub_module_pages`.`content` = '		dasdsadsa  dasd sad sa dasd sad sadsa\r\n	', `sub_module_pages`.`updated_at` = '2021-07-14 17:53:49.919626' WHERE `sub_module_pages`.`id` = 5
INSERT INTO `sub_module_pages` (`module_page_id`, `sub_module_name`, `description`, `link`, `file_pdf`, `content`, `created_at`, `updated_at`) VALUES (1, 'dsadsa', 'dasdsadsa', 'sadda', '/file_pdfs/2021-07-1517:22:10-0500_203977238.pdf', '<p>asdsad asd sad asd sad sadasdsadsadds sadsad sadassssssssss</p>\r\n\r\n<p><span style=\"color:#2ecc71\">dasda dsa dsada dsadsadasd</span></p>\r\n', '2021-07-15 22:22:10.416353', '2021-07-15 22:22:10.416353')
DELETE FROM `sub_module_page_dependences` WHERE `sub_module_page_dependences`.`id` = 1
DELETE FROM `sub_module_pages` WHERE `sub_module_pages`.`id` = 1
SELECT `sub_module_page_dependences`.* FROM `sub_module_page_dependences` WHERE (sub_module_page_id=1)
INSERT INTO `sub_module_page_dependences` (`sub_module_page_id`, `dependence_id`, `created_at`, `updated_at`) VALUES (6, 5, '2021-07-14 20:09:40.994583', '2021-07-14 20:09:40.994583')

  def delete_sub_module

    sub_module = SubModulePage.where('id=?',params[:id])
    module_page_id = sub_module[0]['module_page_id']
    delete_file(sub_module[0]['file_pdf'])
    delete_file(sub_module[0]['image_min'])
    SubModulePageDependence.where('dependence_id=?',params[:id]).destroy_all
---
SELECT `sub_module_pages`.* FROM `sub_module_pages` WHERE (id='5')
SELECT `sub_module_page_dependences`.* FROM `sub_module_page_dependences` WHERE (dependence_id='6')
DELETE FROM `sub_module_pages` WHERE `sub_module_pages`.`id` = 6

  def create_home_banner
    @home_banner  = HomeBanner.where('id=?',params['id']).take if !params['id'].blank?
    @total_banner  = HomeBanner.all.length
    @total_banner = @total_banner+1 if params['id'].blank?
---
SELECT `home_banners`.* FROM `home_banners` WHERE (id = NULL) LIMIT 1
SELECT `home_banners`.* FROM `home_banners`
SELECT `home_banners`.* FROM `home_banners` ORDER BY `home_banners`.`id` DESC

  def insert_home_banner

    image = nil
    image = save_file(params[:image],'images_banner') if !params[:image].blank?

    home_banner = HomeBanner.where('id = ?', params[:id]).take
    home_banner = HomeBanner.new if home_banner.blank?
    home_banner.image = image if !image.nil?
    home_banner.order_banner = params[:order]
    home_banner.save

    home_banners = HomeBanner.where('order_banner>=?',params[:order]).where('id not in (?)',home_banner.id)

    order = params[:order].to_i+1
    home_banners.each do |data|
      banner = HomeBanner.where('id=?',data['id']).take
      banner.order_banner = order
---
SELECT `home_banners`.* FROM `home_banners` WHERE (id=2) LIMIT 1
SELECT `home_banners`.* FROM `home_banners` WHERE (id = '42')
INSERT INTO `home_banners` (`image`, `order`, `created_at`, `updated_at`) VALUES ('/images_banner/2021-07-1417:31:02-0500_Capturadepantallade2020-11-2318-29-47.png', 0, '2021-07-14 22:31:02.088061', '2021-07-14 22:31:02.088061')
UPDATE `home_banners` SET `home_banners`.`order_banner` = 2, `home_banners`.`updated_at` = '2021-07-14 22:43:01.672740' WHERE `home_banners`.`id` = 2
SELECT `home_banners`.* FROM `home_banners` WHERE (id = '1')
SELECT `home_banners`.* FROM `home_banners` WHERE (id = '54')

  def delete_home_banner

    home_banner = HomeBanner.where('id = ?', params[:id])
    delete_file(home_banner[0]['image'])
    home_banner.destroy_all
---
SELECT `home_banners`.* FROM `home_banners` WHERE (id = '1')
DELETE FROM `home_banners` WHERE `home_banners`.`id` = 1

  def create_contact
    @contact  = Contact.where('id=?',params['id']).take if !params['id'].blank?
---
SELECT `contacts`.* FROM `contacts` WHERE (id='1') LIMIT 1

  def insert_contact

    contact = Contact.where('id = ?', params[:id]).take
    contact = Contact.new if contact.blank?
    contact.name = params[:name]
    contact.direccion = params[:direccion]
    contact.edificio = params[:edificio]
    contact.ciudad = params[:ciudad]
    contact.telefono = params[:telefono]
    contact.email = params[:email]
    contact.save
---
SELECT `contacts`.* FROM `contacts` WHERE (id = NULL) LIMIT 1
INSERT INTO `contacts` (`name`, `direccion`, `edificio`, `ciudad`, `telefono`, `email`, `created_at`, `updated_at`) VALUES ('Prolongar', 'Cl 95 # 11 A - 37 oficina 402', 'Oxford Center  P.H.', 'Bogota, Colombia', '+57 322 348 8279', 'asistente@fundacionprolongar.org', '2021-07-14 17:41:12.726995', '2021-07-14 17:41:12.726995')
UPDATE `contacts` SET `contacts`.`telefono` = '+57 322 348 8278', `contacts`.`updated_at` = '2021-07-14 17:46:44.346641' WHERE `contacts`.`id` = 6

  def create_admin

      @user_admin  = UserAdmin.where('id=?',params['id']).take if !params['id'].blank?
---
SELECT `user_admins`.* FROM `user_admins` WHERE (id = '') LIMIT 1

  def insert_admin

      user_admin = UserAdmin.where('id = ?', params[:id]).take
      user_admin = UserAdmin.new if user_admin.blank?
      user_admin.name = params[:name]
      user_admin.password = Digest::SHA256.hexdigest(params[:password]) if !params[:password].blank?
      user_admin.save
---
SELECT `user_admins`.* FROM `user_admins` WHERE (id = '') LIMIT 1
UPDATE `user_admins` SET `user_admins`.`password` = '03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4', `user_admins`.`updated_at` = '2021-07-14 22:15:40.770920' WHERE `user_admins`.`id` = 1
INSERT INTO `user_admins` (`name`, `password`, `created_at`, `updated_at`) VALUES ('alex', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', '2021-07-15 21:04:14.513257', '2021-07-15 21:04:14.513257')

  def delete_admin
      UserAdmin.where('id = ?', params[:id]).destroy_all
---
DELETE FROM `user_admins` WHERE `user_admins`.`id` = 1
SELECT `user_admins`.* FROM `user_admins` WHERE (id = '1')