app/controllers/login_controller.rb

SELECT `user_admins`.* FROM `user_admins` WHERE (name='alex') AND (password='6a8ff0c7a890acaf499794b1ee1cffdf12ea9f76e9ea0bb3bf3bc9a55521f033') LIMIT 1
---
	def login_admin
		admin = UserAdmin.where('name=?',params[:name]).where('password=?',Digest::SHA256.hexdigest(params[:password])).take