app/controllers/web_services_controller.rb

  def info_home

      home_banner=HomeBanner.all.order("order_banner")
      menu_content=MenuContent.all
      module_page=ModulePage.all
      contact=Contact.all
---
SELECT `home_banners`.* FROM `home_banners` ORDER BY order_banner
SELECT `menu_contents`.* FROM `menu_contents`
SELECT `module_pages`.* FROM `module_pages`
SELECT `contacts`.* FROM `contacts`

  def info_page

      id_page = params[:id_page]
      menu_content=MenuContent.all.where( 'id = ?' , id_page ).take
---
SELECT `menu_contents`.* FROM `menu_contents` WHERE (id = ? , id_page) LIMIT 1